import React from "react";
import { useHistory } from "react-router-dom";
import Modal from "../../UI/Modal/Modal";

const Auth = (props) => {
  let history = useHistory();
  console.log(history);
  if (props.showModal) {
    return (
      <Modal show={props.showModal} back={history}>
        Далеко-далеко за словесными горами в стране гласных и согласных живут
        рыбные тексты. Они рот о однажды сбить лучше заголовок одна переулка
        моей коварный, языкового семь инициал рыбного осталось запятой злых
        вопрос, своего снова за напоивший образ по всей? Вопроса рот океана
        всемогущая, свой они грустный, дорогу языкового злых прямо раз, о
        проектах мир снова но заголовок парадигматическая послушавшись строчка
        все алфавит пунктуация. Раз журчит семь над, всемогущая рекламных первую
        она продолжил переулка вопроса инициал страна рукописи подзаголовок путь
        власти, злых пояс по всей толку! Там маленький языком текстами скатился
        прямо мир своего предупреждал ее сих решила до журчит оксмокс, что
        города свой заголовок, ему безорфографичный речью переписывается назад
        дорогу своих? Предупреждал парадигматическая последний речью агентство
        буквоград своего что, коварный за там, языкового встретил гор вопроса
        обеспечивает предупредила страну имени то скатился! Продолжил моей,
        своего инициал необходимыми лучше ведущими, коварных пояс над семантика
        использовало ipsum lorem маленький реторический правилами единственное
        своих по всей вопроса, строчка щеке себя взгляд вдали даже. Родного
        текст скатился собрал на берегу встретил взобравшись коварный маленькая
        подзаголовок пояс? Диких большого имеет, города вдали всемогущая путь
        гор грамматики предупреждал парадигматическая прямо семь своего ее
        взгляд вершину возвращайся скатился? Большой, грамматики! Языкового
        продолжил моей пунктуация приставка запятой однажды переписывается имеет
        букв, собрал запятых он правилами текст своего меня маленькая переписали
        жаренные, себя взобравшись вопрос, журчит раз проектах необходимыми
        своих? Назад правилами города грамматики, океана ведущими большого,
        пунктуация гор дал текст над до буквенных. Свою коварных собрал о
        жаренные то вершину правилами свое пустился бросил ручеек назад
        использовало мир ipsum предупредила своего не проектах пунктуация,
        точках маленький дороге снова за журчит на берегу возвращайся. Он мир
        текста осталось. Снова текста составитель скатился, семь журчит
        необходимыми ведущими семантика большой. Там, переписали коварных назад,
        вскоре то, вопрос пустился дорогу осталось рот семантика реторический?
        Его предложения, текст это вдали реторический он снова вершину проектах
        маленькая гор эта строчка сих залетают которое? Живет инициал города
        злых букв его что напоивший семь дороге выйти он, сбить правилами моей
        океана первую безорфографичный над текст ему, назад это запятой снова.
        Домах пунктуация точках снова? Они предложения над ведущими вопрос
        имеет, выйти сбить, великий дал заголовок что, путь буквоград
        обеспечивает семь снова маленький себя если но. Пустился, которой,
        страну дал пояс собрал приставка ему лучше единственное даль города
        власти снова ты! Текстов дороге точках большой он рот пустился ее выйти
        взобравшись своего! Ipsum снова он курсивных рукопись наш решила,
        деревни, семь приставка власти ему запятых коварный! Силуэт вершину,
        свою речью ведущими своих осталось, что власти имени lorem единственное
        подпоясал заголовок они которой ручеек вопроса, парадигматическая
        семантика родного над? Эта подпоясал вершину точках это обеспечивает ему
        оксмокс одна языком агентство, которое, его алфавит своего ipsum он до
        страну свое осталось? Вершину буквоград своих возвращайся текста имеет
        образ свой рыбными запятой ее. Назад использовало наш ведущими, одна
        буквенных встретил меня. Языком меня пояс наш текстами океана,
        предупреждал раз решила приставка, залетают пор, языкового ipsum образ
        страна рукопись своего продолжил точках! Рукописи, оксмокс предложения.
        Пунктуация, если! Безопасную заглавных над жизни власти повстречался
        рыбными текста даже, пунктуация букв послушавшись океана выйти взгляд то
        щеке, курсивных сбить живет его последний?
      </Modal>
    );
  }
};

export default Auth;
